{"votes": {"funny": 7, "useful": 8, "cool": 7}, "user_id": "LusAw6vTDC7KAfbuClMReA", "review_id": "EfsRPyjXC8k2RkQ4HXXf-g", "stars": 3, "date": "2014-04-18", "text": "I currently view McDonald's as more of a restaurant serving inexpensive snacks than meals. In my opinion, McDonald's is a level or few below the fast food powerhouses starring In N Out, Raising Cane's, and Panda Express. When dinner is far in the horizon and I want to calm my appetite, I order off the McDonald's $1 menu as I look forward to a better meal. The $1 menu features large fountain Coke beverages, a sausage buritto, a hot & spicy chicken sandwich, a double cheeseburger,  small coffee, and other foods.\n\n   Both my check-ins here were when I hiked on the Angel Park Trail system. This McDonald's is convenient to the Angel Park Trail system; which includes the Bonanza Trail, Kellogg Sport's Complex, and Lone Mountain Trail. The restaurant is a convenient respite from outdoor activities. To reach this McDonald's from the Angel Park Trail system; from Bonanza Trail which is really the east spur of Angel Park Trail to you'd walk past the Kellogg Sport's Complex, walk under the Buffalo Drive tunnel and after the K-Mart turn left on Lone Mountain Trail. After Crossing Washington Avenue with a pedestrian signal, you'd turn left and McDonald's is on the right.\n\n  As far as location,  I am curious why McDonald's passed over building the restaurant at the corner of Buffalo at Washington. The existing restaurant a few thousand feet east of Buffalo Drive on Washington Avenue is out of sight lines for motorists driving on Buffalo Drive one traffic signal north of Summerlin Parkway. Then again being McDonald's there is another location a couple of traffic lights north at Buffalo and Lake Mead Boulevard.  \n\n  This is an older McDonald's. This is not surprising considering it is near Kmart. There is no theme. Just a basic McDonald's with a dining and indoor playground area.\n\n  The two check-ins in this basic McDonald's were for a snack. On my first check-in,  I quaffed down the limited time Chocolate strawberry Frape. It was a yummy caffeine boost at a cost of $4 and 600-plus calories. Fortunately this was the halfway point of my hike and I'd burn some of it off. On my follow-up check-in,  I snacked on a Hot & Spicy Chicken with a large Coke. The Coke was flat. That is a no no! If the service wasn't decent and there wasn't a manager presence, this review would fall flat of 3 stars and sink to 2 stars. \n\n  I try to review places when I am a regular. Now that I am a Duke that will probably see that status fade at this location, it is time to emphasize that this is a decent restaurant for a snack or light meal off the Angel Park Trail system and in the vicinity of Washington at Buffalo.", "type": "review", "business_id": "f2IKG29s2pEY1wUAIjFIlA"}
{"votes": {"funny": 0, "useful": 6, "cool": 6}, "user_id": "2HmHgW3hRYvXYFmQyQtLuw", "review_id": "0IgJJHdGL7iNyceHDZJ15g", "stars": 5, "date": "2012-09-21", "text": "This is a great location. Inside the store is clean and the staff is very friendly. They are very fast and the food is correct and hot and tasty! \nI love the Cheddar Quesadillas and Buritto Deluxe. AND they have Cherry Coke!!!", "type": "review", "business_id": "QvXKpK2KsguA8j22Ak65dQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XjHVXGOmu_MiL1gFovqT4A", "review_id": "CYGbXa1BsgMgFzL68J95LQ", "stars": 4, "date": "2013-11-23", "text": "I have ordered to-go from here about 5 times and eaten at the restaurant once.  In my opinion it was a little slow (but that could be because I was starving) thus I prefer to order ahead and pick it up.\n\nThe menu is very extensive and gives lots of options.  The food is good quality and delicious.  While not fancy this place is a good neighborhood option and I am definitely a regular now.\n\nMy personal favorite is the Chow Mein (beef and chicken are delicious).  Other favorites that my friends have liked: Kung Pao Chicken, General Tso's Chicken, Buddha's Delight (Mixed Veggies), and Sweet and Sour Chicken.", "type": "review", "business_id": "C4CbD-0Rz4nglavf_0dRdg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vd1lAHzl7UUr9BawFHjOoA", "review_id": "Qx4tsWrieqLb5QGUxafPTQ", "stars": 3, "date": "2012-06-04", "text": "I tried these guys a while ago but I recall fairly well what the food was like. We called ahead and took the food to go to eat it at home. There was some pad thai, tom yum kai soup, and red curry chicken. It looks like just about any other hole in the wall thai restaurant does-- a few plants and statues and a modest area for seated guests. It's the kind of place that is more packed for lunch on a weekday than dinner.\n\nThe pad Thai wasn't bad. Chewy, sweet and flavorful-- it was satisfying but not particularly memorable. \nThe tom yum kai (red soup) was fantastic-- probably even better than the one I enjoy regularly at Pin Kao. I don't think it was too meaty but it was very tangy and clearly must have contained copious amounts of lemon grass.\n\nThe red chicken however, was rather disappointing. It was finely diced, similar to the way this dish is served at Mix Zone Cafe. Spicy enough but not juicy enough, and it just didn't pan out for me.\n\nTo be fair, I i only tried these few items and have not yet returned to see what else these guys have to offer. I wouldn't be so quick to write these guys off, but until I investigate them further I'll have to keep them at 3 stars.", "type": "review", "business_id": "CLp44IJDJW2mBhSjdBIMiQ"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "47Axeg0deIegNhwatMhC9A", "review_id": "OyvC7CjcZcg3-_VWoUo1Tw", "stars": 4, "date": "2010-11-03", "text": "Ta Ta almost hits a home-run when it comes to making my belly happy. \nThe service is so fast I feel as if they are doing Jedi mind tricks anticipating what I am going to order! Always on top of my beverages and getting the food out quickly.\nThe restaurant itself is clean and never crowded when I have been there.\nThe food- Really nice sized portions, presentation and very fresh ingredients. I highly recommend the General Tso's Chicken or Garlic Chicken lunch specials. Both priced under $7.00 and come with soup, egg roll and rice. No extra charge for brown rice which is an added bonus. I do also enjoy the Dan Dan Noodles and the Garlic Long Bean. For all of you sushi lovers this is my family's number one choice for the price , flavor and size of the rolls. \nThe only reason why I am not rating them five stars is because when I am ready to leave a restaurant I want my bill and Ta Ta has left me hanging with dirty plates and no check every time. Other than that, I LOVE this place and highly recommend it to the world.", "type": "review", "business_id": "C4CbD-0Rz4nglavf_0dRdg"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "ZbYFWoGzpyZjml0NOE7bgg", "review_id": "FTsmhNFf1bheYMTfT3WlOw", "stars": 5, "date": "2012-02-20", "text": "Indian food is my favorite so I couldn't wait to try this new restaurant.  We tried the buffet since there were just two of us and I wanted to try several dishes.  It was wonderful.  My two favorites, baigan bharta and palak paneer, were as good as I have ever had.  I normally have to go to San Rafael CA instead of two miles from my house to get food this good.  At the buffet the dishes are labeled in American terms so I didn't have to translate for my husband.  But it's the real thing.  I like my food medium so the vindaloo was too spicy for me but everything else was just right.  We went in the evening so our tandoori chicken served on a sizzling platter at our table - great presentation and it really kept it hot (they said that at lunch it's on the buffet).  The staff was very friendly, and we found out that they had moved from Stapley and the 60 to this much more convenient location.  Even the chai was good; usually I find it much too sweet.  And although it disconcerted our waitress, I like the sound of the train going by.  We will definitely be regulars.", "type": "review", "business_id": "rbeBreN9KOWipTUQsmiQ9g"}
{"votes": {"funny": 2, "useful": 5, "cool": 2}, "user_id": "wHg1YkCzdZq9WBJOTRgxHQ", "review_id": "FllAxVah2Ixlqmi3c638Xg", "stars": 4, "date": "2012-06-25", "text": "Once upon a time, I used to really love Taj Mahal in this same location.  But it kind of went downhill over time.  Seemed like the prices kept going up while the amount of actual protein served decreased.  But now Southern Spice has moved in, and I've eaten here repeatedly for much more than convenience.  Great food and reasonable prices.\n\nThe chili paneer has become a staple appetizer for my husband and I.  On a good night, it's got just the slightest hint of a crunch to the edges.  On a bad night, still delicious.   I love both the butter chicken and chicken korma.  And the garlic naan...some of the best I've had.  The perfect balance of toastiness on the outside, chewiness on the inside.  The garlic has never been burnt either (I'm talking to you Tandoori Times).  Entrees thankfully include rice.  I have been getting pretty sick and tired of paying extra for that.\n\nI'm only taking a star off because a couple times I got a piece of chicken that wasn't well-trimmed.  I hate having anything in my mouth that I wouldn't willingly swallow.  So not cool.\n\nBut otherwise, I'm a fan and will single-handedly do my best to keep them in business.  I'm generous like that.", "type": "review", "business_id": "d5CSj7DL3l56paYgfpFSkQ"}
